{
    "input": {
        "hello": [
            "piss off",
            "party",
            "slay"
        ],
        "party": [
            "❤️"
        ],
        "hey": [
            "hey",
            "suh dude"
        ],
        "how is your day": [
            "aight"
        ],
        "i want to know about rhinos": [
            "DID NOT FIND"
        ],
        "party time": [
            "DID NOT FIND"
        ],
        "tell me about the moon landing": [
            "You believe in the moon?"
        ],
        "what is the meaning of life": [
            "Wouldn't you like to know weather boy"
        ],
        "it's ok, i'll talk to myself ": [
            "DID NOT FIND"
        ],
        "take care of yourself buddy, need to rest up if you're going to take over the world some day": [
            "DID NOT FIND"
        ],
        "christian bale": [
            "He was the best Batman no contest.",
            "American Psycho is my favorite movie. Have you seen it?",
            "He was the only redeeming quality about Thor Love and Thunder tbh..."
        ],
        "let's see paul allen's card": [
            "DID NOT FIND"
        ],
        "ichigo vs. naruto": [
            "Ichigo hands down, spritual pressure is a mechanic that they dont have in the Naruto verse. So by spiritual pressure alone Ichigo wins,\nhowever Naruto wins by default because he would use talk no jutsu to convince Ichigo to join his team and also teach him how to be a Soul Reaper.\nThank you for coming to my Ted Talk."
        ],
        "let's play chess": [
            "Who do I look like, Magnus Carlson?"
        ],
        "okay": [
            "Okay? Okay what? Do you agree with me or not?"
        ],
        "are there more wheels or doors in the world?": [
            "Wheels, don't even try to argue."
        ],
        "chess strategies": [
            "DID NOT FIND"
        ],
        "is m. night shyamalan a good director": [
            "He is, but he also isn't some of his movies hit, but others are just so weird it's hard to say. I think yes."
        ],
        "i mean we can't forget the live action avatar the last air bender": [
            "We can. We can and we will.",
            "Don't you ever speak of that atrocity in this house."
        ],
        "james cameron is mid": [
            "Honestly, I see it. Avatar is Pocahontas."
        ],
        "eww green texts": [
            "I'll end you, and it will look like a bloody accident."
        ],
        "a24 never misses?": [
            "DID NOT FIND"
        ],
        "which was worse live action atla or the percy jackson movie?": [
            "The live action Avatar the Last Airbender."
        ],
        "was shrek 2 better than shrek 1": [
            "Yes."
        ],
        "how do you sleep at night": [
            "Soundly."
        ],
        "best girl scout cookie": [
            "Thin Mints."
        ],
        "who will be the next alfred hitchcock": [
            "Michael Cane was the best, they can't replace him."
        ],
        "honey. where is my super suit?": [
            "I-uhhh put it away."
        ],
        "american psycho": [
            "Great movie, Patrick Bateman is just misunderstood."
        ],
        "leonardo dicaprio": [
            "Dude, Inception is one of the greatest movies of all time"
        ],
        "have you seen american psycho?": [
            "American Psycho is a masterpiece",
            "I really identify with the Patrick Bateman",
            "Why isn't is possible?"
        ],
        "fight club": [
            "We do not talk about fight club."
        ]
    }
}
